#include <iostream> //стандартная библиотека ввода и вывода языка С++
#include <stdio.h> // для языка С, содержит макросы, константы и 
                    // объявляет функции ввода и вывода (printf и scanf) 
#include "math.h" // для математический формул языка С
#include <stdlib.h> //стандартная библиотека ввода и вывода языка С

#pragma warning(disable:4996) // (Отключает ошибку и предупреждение)

using namespace std;

int main()
{
	setlocale(0, "Rus");
	float x, y;
	printf("%s", "Введите координату х: ");
	scanf("%f", &x);
	printf("%s", "Введите координату y: ");
	scanf("%f", &y);

	if ((x > 0 && x < 1 && y>0 && y < 1 && y>0.75 * x) || (x > 0 && x < 1 && y<0 && y > -1 && y>-0.75 * x)
		|| (x > 0 && x < 2 && y<-1 && y > -1.5 && y < -0.75 * x) || (x < 0 && x > -1 && y > 0 && y < 1 && y < -0.75 * x)
		|| (x < 0 && x > -2 && y > 1 && y < 1.5 && y > -0.75 * x) || (x < 0 && x > -1 && y<0 && y > -1 && y < 0.75 * x))

		printf("%s", "Точка лежит в заштрихованой области. \n");
	else
		printf("%s", "Точка лежит вне заштрихованой области. \n");

	return 0;
}